<?php

session_start();
?>
<!DOCTYPE html>

<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <meta http-equiv="X-UA-Compatible" content="ie=edge">
  <title>Questionnaire</title>
  <link rel="stylesheet" href="../resource/css/bootstrap.min.css">
  <link rel="stylesheet" href="../resource/css/Questionnaire.css">
  <link rel="stylesheet" href="../resource/css/header.css">
</head>

<body>
     
<header class="container">
    <nav class="navbar navbar-default">
      <div class="container-fluid">
        <div class="navbar-header">
          <a href="Home.php" class="navbar-brand" ><img src="../resource/images/logo.png" alt=""></a>
        </div>
        <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
          <ul class="nav navbar-nav links">
            <li ><a href="Home.php"> Home</a> </li>      <!-- Home button-->
            <li class="active"><a href="#"> Questionnaire</a> </li>      <!-- qusetionnaire button-->
          </ul>

          <ul class="nav navbar-nav navbar-right">
            <li><a class="btn" id="login" href="Login.php">Login</a> </li>       <!-- login button-->
          </ul>
        </div>
      </div>
    </nav>
  </header>

<body>
    <img src="../resource/images/5.jpg" alt="" class="bg-image">
    <div class="blure-body"></div>

<?php
//array of Questions Arabic
$q=array('ملاحظة','نحن مطالبون بموجب التعليمات و حرصا على سلامة المرضى بطرح الأسئلة التالية و التي لا يقصد بها التدخل في أمور المتبرع الشخصية أو إلحاق أي إساءة به و إذا شعرت بعدم الرغبة في الإجابة عليها الرجاء إعادة الورقة إلى الموظف مع العلم بأن كافة الإجابات ستعامل بسرية تامة.'
    ,'هل ؟','تتمتع بالصحة و العافية اليوم؟ و هل حصلت على قسط كاف من النوم؟','تناولت وجبة خلال الثلاث ساعات الماضية؟',
    'تتناول أي مضاد حيوي؟','تتناول حاليا أي أدوية أخرى لعلاج الالتهاب؟','تتناول حاليا أو سبق لك أن تناولت أي من الأدوية التالية: بروسكار - افودارت–بروبيشيا–اكيوتان–سورياتان–تيجيسون– هرمون النمو –اميونوجلوبلين الكبد الوبائي (ب)؟'
    ,'اطلعت على المواد الثقافية و حصلت على إجابات لتساؤلاتك؟','خلال الـ 48 ساعة الماضية هل:','تناولت الأسبرين أو أي دواء يحتوي على الأسبرين؟'
    ,'للإناث فقط: هل سبق لك الحمل أو أنك حامل الآن؟  ','خلال الـ 8 أسابيع الماضية هل:','تبرعت بالدم أو بصفائح الدم أو ببلازما الدم؟',
    'تلقيت أي لقاح أو أي إبرة؟','كان لك اتصال مع شخص تلقى لقاح الجدري؟','خلال الـ 16 أسبوع الماضية هل','تبرعت بوحدتي خلايا دم باستخدام جهاز سحب و فرز مشتقات الدم؟'
,'خلال الـ 12 شهر الماضية هل:','خضعت لعملية زرع عضو أو نسيج أو نخاع عظم؟','خضعت لعملية ترقيع عظمي أو جلدي؟','لامست دم شخص آخر؟',
    'تعرضت لحادثة وخز عرضي بإبرة؟','كان لك إتصال جنسي مع أي شخص مصاب بفيروس نقص المناعة المكتسب " الإيدز " أو كانت نتيجة اختبار فيروس نقص المناعة المكتسب " الإيدز " لديه ايجابية؟ '
,'كان لك اتصال جنسي مع مومس أو أي شخص يتقاضى المال أو المخدرات أو غيرها مقابل الجنس؟','كان لك اتصال جنسي مع شخص اعتاد على استخدام الإبر لتعاطي المخدرات أو الستيرويدات أو أي مستحضر لم يصفه الطبيب؟'
,'كان لك اتصال جنسي مع أي شخص مصاب بالنزاف " الناعور " أو يستخدم محاليل عوامل التجلط المركزة؟'
,'للإناث فقط: هل كان لك اتصال جنسي مع رجل له اتصال جنسي مع رجل لآخر؟','كان لك اتصال جنسي مع أي شخص مصاب بالتهاب كبدي؟','أقمت مع شخص مصاب بالتهاب كبدي؟'
,'خضعت لوشم أو ثقب للأذن أو أي منطقة من الجسم؟','خضعت أو تخضع حاليا للعلاج من مرض الزهري أو السيلان؟','تم إيقافك في سجن الأحداث أو سجن عادي لمدة تزيد عن 72 ساعة؟'
,'أجريت عملية حجامة؟','خلال فترة الـ 3 سنوات الماضية هل','سافرت خارج المملكة العربية السعودية؟','أصبت بالملاريا أو زرت بلدا تتفشى فيه الملاريا؟'
,'منذ عام 1980 م إلى 1996 م هل','أمضيت (3) أشهر أو أكثر في المملكة المتحدة ( فضلا راجع قائمة المناطق في المملكة المتحدة )؟'
,'منذ عام 1980 م و حتى اليوم هل','قضيت (5) سنوات أو أكثر في أوروبا ( فضلا راجع قائمة الدول الأوروبية )؟','نقل لك وحدات دم في المملكة المتحدة أو فرنسا( فضلا راجع قائمة المناطق في المملكة المتحدة )؟'
,'منذ العام 1970 م و حتى اليوم هل','تلقيت المال أو المخدرات أو غيرها مقابل الجنس؟','للذكور فقط: هل كان لك اتصال جنسي برجل آخر أو لمرة واحدة فقط؟  '
,'هل سبق لك أن','تم نقل وحدات دم إليك؟','كانت نتيجة فحص فيروس نقص المناعة المكتسب " الإيدز " موجبة؟','استخدمت الإبر لأخذ حقن أو ستيرويد أو أي مستحضر دوائي لم يصفه لك الطبيب؟'
,'استخدمت محاليل عوامل التجلط المركزة أو الأنسولين؟','أصبت بالالتهاب الكبدي؟','تعرضت للأمراض التالية ( شاغاس–بابييزا– الحمى المالطية )؟'
,'أجريت ترقيع الأم الجافية ( غطاء الدماغ )؟','تعرضت لأي نوع من السرطان بما في ذلك سرطان الدم ( اللوكيميا )؟','تعرضت لأي مشكلة في القلب أو الرئتين؟'
,'تعرضت لحالة نزيف دموي أو مرض دموي؟','كان لك اتصال جنسي مع أي شخص ولد أو عاش في أفريقيا؟','قمت بزيارة أفريقيا؟','كان أحد أقاربك يعاني من مرض ( كروتزفيلد– جاكوب – جنون البقر )؟'
,'هل تتبرع بدمك لأحد أفراد عائلتك ( أبناء – أخوة – والدين ) من الذين سيحصلون على الدم؟','تبرعت بالدم تحت اسم مختلف أو رقم بطاقة مختلف؟'
,'تقدمت للتبرع بالدم و رفضت أو طلب منك عدم التبرع؟','تبرعت بالدم و طلبت عدم إعطاء الدم للمريض؟','هل تريد التبرع بالدم لإنقاص نسبة هيموجلوبين الدم ( نسبة الحديد بالدم )؟'
,'هل تريد التبرع بالدم من أجل إجراء فحص الإيدز أو أي فحوصات أخرى فقط؟'
,':إقرار المتبرع','قرأت و تفهمت المعلومات المقدمة لي حول انتشار فيروس الايدز من خلال الدم و البلازما, و إن كنت أشكل خطرا لانتشار الفيروس المسبب لمرض الايدز فإنني أوافق على الامتناع عن التبرع بالدم أو البلازما بغرض نقلهما إلى شخص آخر أو بغرض تصنيعهما, أدرك بأنه سيتم إخضاع عينة من دمي لاختبار الإيدز و غيره من الأمراض و إذا تبين بنتيجة الاختبار بأنه ينبغي على الامتناع عن التبرع بالدم أو البلازما بسبب خطر نقل فيروس  الايدز فإن اسمي سوف يدرج على لائحة المتبرعين للممنوعين من التبرع بالدم بشكل دائم , أدرك أيضا بأنه سيتم إبلاغي في حال كانت نتيجة الاختبار ايجابية و إذا لم تظهر نتيجة ايجابية أو سلبية واضحة للاختبار فإن دمي لن يتم استخدامه و اسمي قد يدرج على قائمة المؤجلين دون إبلاغي بذلك إلى حين توضيح النتائج بشكل مستفيض, أعلم أيضا بإمكانية انسحابي من عملية التبرع في كل وقت ( قبل – أثناء – أو بعد التبرع بالدم ) إذا شعرت بأن دمي غير صالح للنقل إلى المرضى, أعلم أيضا بأنه يمكنني إتمام عملية التبرع مع عدم إعطاء الدم المتبرع به إلى المرضى و ذلك بوضع علامة على مربع ( أرجو استخدام دمي بغرض الأبحاث فقط ) أسفل الصفحة, أعلم أيضا أنه في بعض الحالات الطارئة يتم صرف الدم أو البلازما الذي تبرعت به من دون إجراء بعض أو حتى كل الفحوصات للأمراض المعدية , أفوض مركز التبرع بالدم بسحب 450 ملليلتر  ( تقريبا ) من دمي أو لإجراء عملية سحب مشتقات الدم الآلية و أمكنهم من التصرف بدمي بالطريقة المناسبة, لقد قمت بالإجابة على جميع الأسئلة بكل مصداقية و المعلومات التي أدليت بها صحيحة و على مسؤوليتى   '
,':هل تريد ان تكون صديق بنك الدم',' فى حاله الحاجه الى دم ,سوف يتم الاتصال بك'
);




//insert question
if(isset($_POST['accept'])){
    $quesions=implode('-',$_POST);
    include "../model/donar.php";
    new donar();
    $result=donar::insert($quesions,$_SESSION['donar_id']);
    $_SESSION['Questionnire']=$result;
    if(isset($_POST['friend'])){
        include '../model/Receptionist.php';
        new Receptionist();
        Receptionist::updateFriend($_SESSION['donar_id']);
    }
    header('location:Home.php');


        ?>



    <?php

}
//check user and show question
elseif(isset($_POST['NID']) && $_POST['NID'] ){

    //validation
    if(strlen($_POST['NID'])!=10){


        $_SESSION['error']="national id must be 10 number";
        header('location:Home.php');
        exit();
    }


    include '../model/Receptionist.php';
    new Receptionist();
    include "../model/donar.php";
    new donar();

    //check if insert data in receptionist

    $search=Receptionist::search(filter_var($_POST['NID'],FILTER_SANITIZE_NUMBER_INT));

    if($search){
        //check if is insert questionnaire
        if (donar::search($_POST['NID'])!=null){

            $_SESSION['error']="You have already entered the questionnaire";
            header('location:Home.php');
            exit();
        }else
            {

            $_SESSION['donar_id'] = $_POST['NID'];
            foreach ($search as $donar){ $_SESSION['donar_name'] = $donar['firstName'];}
            
         echo'   <div>';
           echo   $_SESSION['donar_name'] .'</div>';
            ?>
            <!--ملاحظه-->
             <div class="report">
                 <h3><?php  echo $q[0]?> </h3>
                 <?php echo $q[1] ?>

             </div>

            <div class="col-md-8 col-md-offset-2">
              <!--      questionnaire form-->

            <form action="" method="post">
                <div class="table-container">
                
                <table class="table table-hover ">
                    <caption>الاستبيان</caption>
                    <tr>


                        <th>لا</th>
                        <th>نعم</th>
                        <th>السؤال</th>
                    </tr>

                    <?php

                    for ($x = 2; $x < 65; $x++) {
                        if ($x == 2 || $x==9 || $x==12 || $x==16 || $x==18 || $x==34 || $x==37 || $x==39 || $x==42 || $x==45) {
                            echo "   <tr>
                            <td colspan='3'>" . $q[$x] . "</td>
                        </tr>";

                        } else {

                            echo "   <tr>
                        
                            
                            <td><input type=\"radio\" name=\"q" . $x . "\" value=\"1\" required></td>
                            <td><input type=\"radio\" name=\"q" . $x . "\" value=\"0\"></td>
                            <td>" . $q[$x] . "</td>
                        </tr>";

                        }
                    }

                    ?>


                </table>
                </div>


<!--صديق بنك الدم-->
                <div class="report">
                    <h4><?php echo $q[67];?></h4>
                    <p>
                        <?php echo  '<input type="checkbox" name="friend"  value="1" >'.$q[68];?>



                    </p>

                </div>

<!--الفرار-->

                <div class="report">
                    <h4>  <?php echo $q[65];?></h4>
                    <p>
                       <?php echo$q[66];?>
                        <input class="btn btn-danger" type="submit" value="موافق" name="accept" >

                    </p>

                </div>



                <?php
        }
    }

    else{

        $_SESSION['error']="You shoud insert your data in receptionist ";
        header('location:Home.php');
        exit();
    }
}
else {


    header('location:Home.php');
}